USE [mydb];
GO

INSERT INTO [PlantSpecies] ([Name], [CareAdvice]) VALUES
(N'Фикус  Бенджамина', N'Требует яркого рассеянного света. Не любит перестановки и сквозняки.'),
(N'Монстера Деликатесная', N'Любит высокую влажность воздуха, регулярное опрыскивание листьев.'),
(N'Замиокулькас', N'Крайне неприхотлив. Отлично переносит засуху.'),
(N'Орхидея Фаленопсис', N'Специфический субстрат из коры. Полив методом погружения горшка в воду.'),
(N'Спатифиллум', N'Любит полутень и обильный полив. При нехватке воды сразу опускает листья.');

INSERT INTO [Plants] ([Name], [PhotoPath], [PlantSpeciesID]) VALUES
(N'Фикус на подоконнике', N'images/ficus_kitchen.jpg', 1),
(N'Монстера в гостиной', N'images/monstera_hall.jpg', 2),
(N'Долларовое дерево в спальне', NULL, 3),
(N'Белая орхидея', N'images/orchid_white.jpg', 4),
(N'Женское счастье', N'images/spathiphyllum_bedroom.jpg', 5);

INSERT INTO [ProcedureType] ([Name]) VALUES
(N'Полив'),
(N'Удобрение'),
(N'Пересадка'),
(N'Опрыскивание'),
(N'Обрезка');

INSERT INTO [CareSchedules] ([PlantID], [Frequency], [NextDate], [ProcedureTypeID]) VALUES
(1, 4, '2026-05-26', 1),
(2, 7, '2026-05-25', 1),
(3, 14, '2026-06-02', 1),
(4, 10, '2026-05-28', 1),
(5, 30, '2026-06-15', 2);

INSERT INTO [CareHistory] ([PlantsID], [PerformedAt], [Note], [ProcedureTypeID]) VALUES
(1, '2026-05-22 10:00:00', N'Полит отстоявшейся водой комнатной температуры.', 1),
(2, '2026-05-18 12:30:00', N'Обильный полив, протерты листья от пыли.', 1),
(3, '2026-05-19 15:00:00', N'Полив после долгой засухи.', 1),
(4, '2026-05-18 09:15:00', N'Полив теплым душем методом погружения на 20 минут.', 1),
(5, '2026-05-16 11:45:00', N'Внесено комплексное минеральное удобрение для цветущих.', 2);

INSERT INTO [Reminders] ([TimeShow], [IsShown], [CareSchedulesID]) VALUES
('2026-05-26 09:00:00', 0, 1),
('2026-05-25 09:00:00', 0, 2),
('2026-06-02 10:00:00', 0, 3),
('2026-05-18 09:00:00', 1, 4),
('2026-05-16 11:00:00', 1, 5);
GO